10 REM LUNAR LANDER
20 PRINT "*** ПОСАДКА НА ЛУНУ ***"
30 PRINT "ВЫСОТА 500 М. ТОПЛИВО 400."
40 PRINT "ТЯГА 0-30 ЗА ХОД. ТЯГОТЕНИЕ 5."
45 PRINT "МЯГКАЯ ПОСАДКА ПРИ СКОРОСТИ ДО 5."
50 V01 = 50
51 V01 = V01 * 10
60 V02 = 0
70 V03 = 40
71 V03 = V03 * 10
80 V04 = 0
100 V04 = V04 + 1
110 PRINT "--- ХОД";V04;" ВЫСОТА";V01;" СКОРОСТЬ";V02;" ТОПЛИВО";V03
130 PRINT "ТЯГА (0-30)"
140 INPUT V05
150 IF V05 < 0 GOTO 130
160 IF V05 > 30 GOTO 130
170 IF V05 > V03 GOTO 190
180 GOTO 200
190 V05 = V03
200 V03 = V03 - V05
210 V06 = V05 / 2
220 V02 = V02 + 5
230 V02 = V02 - V06
240 V01 = V01 - V02
250 IF V01 > 0 GOTO 100
260 PRINT "*** КАСАНИЕ ПОВЕРХНОСТИ ***"
270 PRINT "СКОРОСТЬ УДАРА";V02
280 IF V02 < 6 GOTO 320
290 IF V02 < 16 GOTO 340
300 PRINT "*** КРУШЕНИЕ! ЭКИПАЖ ПОГИБ ***"
310 GOTO 350
320 PRINT "*** ОТЛИЧНАЯ ПОСАДКА! ***"
330 GOTO 350
340 PRINT "*** ЖЕСТКО, НО ЭКИПАЖ ЖИВ ***"
350 END
