10 REM PLAN GAME
20 PRINT "*** ПЛАНОВОЕ ХОЗЯЙСТВО ***"
30 PRINT "ВЫ РУКОВОДИТЕ ХОЗЯЙСТВОМ 10 ЛЕТ"
40 V01 = 100
50 V02 = 2800
60 V04 = 1
80 PRINT "--- ГОД";V04
90 PRINT "НАСЕЛЕНИЕ";V01;" ЗЕРНО";V02
120 PRINT "ЗЕРНА НА ЕДУ (20 НА ЧЕЛОВЕКА)"
130 INPUT V05
140 PRINT "ГЕКТАРОВ ЗАСЕЯТЬ (1 ЗЕРНО = 1 ГА)"
150 INPUT V06
160 V02 = V02 - V05
170 V02 = V02 - V06
180 V07 = V06 * 3
190 V02 = V02 + V07
200 V08 = V05 / 20
210 IF V08 > V01 GOTO 240
220 V01 = V08
230 PRINT "ГОЛОД! ЛЮДЕЙ ОСТАЛОСЬ";V01
240 V04 = V04 + 1
250 IF V04 > 10 GOTO 270
260 GOTO 80
270 PRINT "*** КОНЕЦ ПЛАНА ***"
280 PRINT "НАСЕЛЕНИЕ";V01;" ЗЕРНО";V02
300 END
